/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Cannot Complete Action";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Try again later.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "This media format is not supported.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "This media may be damaged.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "This app is not authorized to play this file."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "This media cannot be used.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Cannot Decode";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "The decoder required for this media is busy.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Stop any other actions that decode media and try again.";
